{
  "backend/main.mo": "Main actor for the W.R.A.I.T.H. backend, implementing CRUD operations for agents, missions, assets, most-wanted, weapons, and user profiles with role-based access control via AccessControl and MixinAuthorization mixins.",
  "backend/migration.mo": "Defines old and new actor state types and a migration function that upgrades existing state by adding the `nextWeaponId` counter and an empty `weapons` map.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (weapon hooks, Weapons page, routing/navigation, WeaponManager admin component) to their source files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "A JSON document providing one-line summaries of each frontend source file, describing their roles and recent changes such as added weapon support and redacted agent styling.",
  "frontend/index.css": "Global stylesheet importing Tailwind directives and defining CSS custom properties for light and dark theme color tokens used throughout the UI.",
  "frontend/index.html": "HTML entry point for the W.R.A.I.T.H. frontend, mounting the React app into a `#root` div and loading the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with eight routes (home, agents, missions, assets, weapons, most-wanted, admin, DKS department) wrapped in a React Query provider.",
  "frontend/src/components/admin/AgentManager.tsx": "Admin panel component for full CRUD management of agents, including create/edit dialogs and actions for banning, redacting, and removing agents via React Query hooks.",
  "frontend/src/components/admin/AssetManager.tsx": "Admin panel component for creating, editing, and deleting assets, using a dialog form with fields for name, type, department, status, description, and clearance level.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Displays a grid of W.R.A.I.T.H. department cards with metadata like clearance level and availability, linking to available department routes and visually disabling unavailable ones.",
  "frontend/src/components/admin/MissionManager.tsx": "Admin panel component for creating, editing, and deleting missions, with a dialog form supporting fields for title, department, classification, status, description, assigned agents, and date.",
  "frontend/src/components/admin/MostWantedManager.tsx": "Admin UI component for managing 'Most Wanted' entries, providing a table view with create, edit, and delete operations via a dialog form and alert confirmation.",
  "frontend/src/components/admin/WeaponManager.tsx": "Admin UI component for managing weapons inventory, offering a table with create, edit, and delete functionality through a dialog form with fields for type, department, status, and clearance level.",
  "frontend/src/components/Footer.tsx": "Footer component displaying a classified disclaimer, copyright year, and a caffeine.ai attribution link in a monospace terminal style.",
  "frontend/src/components/Layout.tsx": "Layout wrapper that renders Navigation at the top and Footer at the bottom around the main content area in a full-height flex column.",
  "frontend/src/components/Navigation.tsx": "Renders the sticky top navigation bar with links to all main routes and an admin link, supporting both desktop and mobile (hamburger menu) layouts with active-state styling.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, initializing it with the current Internet Identity and an admin token, and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for CRUD operations on backend entities (agents, missions, assets, most wanted, weapons), wrapping actor calls with query invalidation on mutation success.",
  "frontend/src/index.css": "Global stylesheet importing tactical/military-themed fonts and defining custom Tailwind utilities for scanlines, terminal borders, redacted text, glow effects, and classified stamp styles.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/Admin.tsx": "Password-protected admin panel that gates access via a session-stored credential and renders tabbed management components for agents, missions, assets, most wanted, departments, and weapons.",
  "frontend/src/pages/Agents.tsx": "Displays a grid of agent cards fetched from the backend, showing codename, rank, department, and clearance info, with redacted styling for agents marked as 'Redacted'.",
  "frontend/src/pages/Assets.tsx": "Renders a classified asset registry page by fetching all assets and displaying them in cards with clearance level, department, status, and description fields.",
  "frontend/src/pages/DKSDepartment.tsx": "Detail page for the D.K.S. (Directorate of Kinetic Solutions) department, showing division info, key functions, and live stats (agents, missions, assets) filtered to that department.",
  "frontend/src/pages/Home.tsx": "Landing portal page displaying the W.R.A.I.T.H. branding, quick-access links to agents/missions/assets/most-wanted, and an organizational structure listing of the four directorates.",
  "frontend/src/pages/Missions.tsx": "Displays a classified missions dashboard fetched via `useGetAllMissions`, grouping missions into Active, Completed, and Redacted sections with color-coded cards that obscure redacted content.",
  "frontend/src/pages/MostWanted.tsx": "Renders a W.R.A.I.T.H. Most Wanted board using data from `useGetAllMostWanted`, displaying threat-level-styled cards with name, alias, charges, last known location, and capture status.",
  "frontend/src/pages/Weapons.tsx": "Shows a weapons registry page fetched via `useGetWeapons`, grouping weapons by type and rendering cards with clearance level, department, status, and description.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining a dark spy-themed design system with custom W.R.A.I.T.H. color tokens, Orbitron/mono fonts, glow shadows, and animation keyframes.",
  "project_state.json": "Tracks the project state for the W.R.A.I.T.H. Portal agency management app, including existing features and new feature requests related to adding a weapons tab with full CRUD support across frontend and backend."
}