{
  "backend/main.mo": "Main Motoko actor for the W.R.A.I.T.H. portal defining Agent, Mission, Asset, and MostWanted types with full CRUD operations and auto-incrementing IDs. Includes blob storage mixin and status management functions like banAgent and redactAgent.",
  "feature_evidence.json": "Feature evidence report identifying a single high-confidence fix targeting DepartmentManager.tsx to resolve TypeScript errors introduced in the Version 12 deployment that added admin access across all clearance level departments.",
  "frontend-file-summaries.txt": "JSON map of all frontend source files to short summaries describing each component's role, recent changes, and key implementation details for the W.R.A.I.T.H. portal.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes including colors, borders, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the W.R.A.I.T.H. React app, mounting the root div and loading the main.tsx module entry point.",
  "frontend/src/App.tsx": "Root React app component setting up TanStack Router with seven routes (home, agents, missions, assets, most-wanted, admin, /departments/dks) wrapped in a QueryClientProvider and Layout component.",
  "frontend/src/components/admin/AgentManager.tsx": "Admin CRUD component for agents featuring a create/edit dialog, status dropdown including Redacted, and per-row Ban, Redact (EyeOff), and Remove action buttons with confirmation dialogs.",
  "frontend/src/components/admin/AssetManager.tsx": "Admin UI component for managing assets with full CRUD operations, rendered as a table with create/edit dialog and delete confirmation. Supports fields like name, type, department, status, clearance level, and description.",
  "frontend/src/components/admin/DepartmentManager.tsx": "Displays a grid of department cards for the W.R.A.I.T.H. organization, showing metadata like clearance level and availability, with navigation links to available department routes.",
  "frontend/src/components/admin/MissionManager.tsx": "Admin UI component for managing missions with full CRUD operations, supporting fields like title, department, classification, status, assigned agents, and date via a dialog form and table view.",
  "frontend/src/components/admin/MostWantedManager.tsx": "Admin UI component for managing a most-wanted list with CRUD operations, supporting fields like name, alias, threat level, last known location, charges, and status.",
  "frontend/src/components/Footer.tsx": "Footer component displaying a classified disclaimer, copyright year, and a caffeine.ai attribution link with the app's hostname encoded as a UTM parameter.",
  "frontend/src/components/Layout.tsx": "Layout wrapper component that renders Navigation at the top, Footer at the bottom, and children in a flex-column full-height container.",
  "frontend/src/components/Navigation.tsx": "Sticky top navigation bar with desktop and mobile menus linking to all main portal routes, with active-state highlighting and a red-styled Admin access link.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using the current Internet Identity, returning either an authenticated or anonymous actor and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context backed by DFINITY's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on agents, missions, assets, most-wanted, and departments, wrapping backend actor calls with cache invalidation.",
  "frontend/src/index.css": "Global stylesheet importing tactical/spy-themed fonts and defining Tailwind CSS custom properties, utility classes (scanlines, glow effects, redacted bars, stamps, animations) for the app's dark terminal aesthetic.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Admin.tsx": "Password-protected admin panel page with session-based authentication that provides tabbed management interfaces for agents, missions, assets, most-wanted, and departments.",
  "frontend/src/pages/Agents.tsx": "Public agents listing page that renders agent dossier cards with redacted styling for agents with Redacted status, showing rank, department, clearance, and bio details.",
  "frontend/src/pages/Assets.tsx": "Public assets registry page that displays classified equipment and resource profiles in cards with clearance-level color coding and status indicators.",
  "frontend/src/pages/DKSDepartment.tsx": "React page displaying the D.K.S. (Directorate of Kinetic Solutions) department overview, including divisions, key functions, and live stats (agents, missions, assets) fetched via query hooks filtered to the D.K.S. department.",
  "frontend/src/pages/Home.tsx": "React home page for the W.R.A.I.T.H. portal, rendering a hero section, quick-access links to agents/missions/assets/most-wanted, and an organizational structure listing of all four directorates.",
  "frontend/src/pages/Missions.tsx": "React page that fetches and displays all missions grouped by status (Active, Completed, Redacted), with redacted missions visually censored and classification/status color-coded.",
  "frontend/src/pages/MostWanted.tsx": "React page that fetches and displays most-wanted individuals as styled cards, grouped by 'At Large' vs. other statuses, with threat-level and status color coding.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom W.R.A.I.T.H. color tokens (ops-*), custom fonts (Orbitron, Rajdhani, Share Tech Mono), glow box shadows, and animation keyframes, plus plugins for typography, container queries, and animate.",
  "project_state.json": "Project state metadata file tracking version, existing features, and a fix request targeting runtime errors introduced in the V12 deployment across Admin.tsx, DepartmentManager.tsx, and useQueries.ts."
}