{
  "kind": "build_request",
  "title": "Add Weapons tab to the agency portal",
  "projectName": "W.R.A.I.T.H. Portal",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a `Weapon` type to the backend actor in backend/main.mo with fields: id (Nat), name (Text), type (Text), department (Text), status (Text), clearanceLevel (Nat), description (Text). Implement CRUD functions: createWeapon, getWeapons, updateWeapon, deleteWeapon with auto-incrementing IDs following the same pattern used for Agent, Mission, and Asset types.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Make a tab that they can look at different weapons inside of the agency"
        ]
      },
      "acceptanceCriteria": [
        "Weapon type is defined with all listed fields",
        "createWeapon, getWeapons, updateWeapon, deleteWeapon functions are implemented",
        "Weapon IDs auto-increment using the same counter pattern as other entity types",
        "Weapons are stored in stable state"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add React Query hooks for weapons in frontend/src/hooks/useQueries.ts: useGetWeapons, useCreateWeapon, useUpdateWeapon, useDeleteWeapon — following the same pattern used for assets and other entities, with cache invalidation on mutation.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Make a tab that they can look at different weapons inside of the agency"
        ]
      },
      "acceptanceCriteria": [
        "useGetWeapons hook fetches all weapons from the backend actor",
        "useCreateWeapon, useUpdateWeapon, useDeleteWeapon mutation hooks are implemented",
        "All mutations invalidate the weapons query cache"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Create a new public-facing Weapons page at frontend/src/pages/Weapons.tsx that displays all agency weapons as styled cards matching the W.R.A.I.T.H. dark terminal aesthetic. Each card should show weapon name, type, department, clearance level (color-coded like Assets), status indicator, and description. Group or visually distinguish weapons by type or department.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Make a tab that they can look at different weapons inside of the agency"
        ]
      },
      "acceptanceCriteria": [
        "Weapons page renders all weapons fetched from the backend",
        "Each weapon card displays name, type, department, clearance level, status, and description",
        "Clearance level is color-coded consistently with the Assets page styling",
        "Page matches the existing dark terminal/spy aesthetic (Orbitron font, scanlines, glow effects, etc.)",
        "Empty state is handled gracefully when no weapons exist"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add a 'Weapons' route to the TanStack Router in frontend/src/App.tsx (e.g., /weapons) and add a corresponding navigation link in frontend/src/components/Navigation.tsx, positioned alongside the existing Agents, Missions, Assets, and Most Wanted links.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Make a tab that they can look at different weapons inside of the agency"
        ]
      },
      "acceptanceCriteria": [
        "Navigating to /weapons renders the Weapons page",
        "A 'Weapons' link appears in both desktop and mobile navigation menus",
        "The navigation link highlights correctly when the /weapons route is active"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Create a WeaponManager admin component at frontend/src/components/admin/WeaponManager.tsx with full CRUD operations (create, edit, delete) using a dialog form and table view, following the same pattern as AssetManager.tsx. Fields: name, type, department, status, clearance level, description. Add a 'Weapons' tab to the admin panel in frontend/src/pages/Admin.tsx alongside the existing tabs.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "Make a tab that they can look at different weapons inside of the agency"
        ]
      },
      "acceptanceCriteria": [
        "WeaponManager renders a table of all weapons with edit and delete actions per row",
        "A create dialog allows adding a new weapon with all required fields",
        "Edit dialog pre-populates fields for the selected weapon",
        "Delete action includes a confirmation dialog",
        "A 'Weapons' tab appears in the Admin panel and renders WeaponManager when selected"
      ]
    }
  ],
  "constraints": [
    "All Motoko logic must remain in the single actor file backend/main.mo",
    "Do not modify any files listed under frontend.immutablePaths",
    "New UI must match the existing W.R.A.I.T.H. dark terminal aesthetic (Orbitron/Rajdhani fonts, scanlines, glow effects, ops-* color tokens)"
  ],
  "nonGoals": [
    "No real-time weapon tracking or map-based location features",
    "No weapon image uploads or blob storage for weapons",
    "No separate department sub-pages for weapons"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}